In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import matplotlib.cm as cm

tweets = pd.read_csv('csv/train.csv', usecols=['location', 'target'])
tweets.head()

  location  target
0      NaN       1
1      NaN       1
2      NaN       1
3      NaN       1
4      NaN       1

In [2]:
tweets.fillna(value= 'Not Especified')

            location  target
0     Not Especified       1
1     Not Especified       1
2     Not Especified       1
3     Not Especified       1
4     Not Especified       1
...              ...     ...
7608  Not Especified       1
7609  Not Especified       1
7610  Not Especified       1
7611  Not Especified       1
7612  Not Especified       1

[7613 rows x 2 columns]

In [3]:
tweets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7613 entries, 0 to 7612
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   location  5080 non-null   object
 1   target    7613 non-null   int64
dtypes: int64(1), object(1)
memory usage: 119.1+ KB

In [4]:
tweets['location'].value_counts()

USA                      104
New York                  71
United States             50
London                    45
Canada                    29
                        ...
VitÌ_ria (ES)              1
The dark                   1
antioch, california        1
Den Helder, Rijkswerf      1
Houston, Texas             1
Name: location, Length: 3341, dtype: int64

In [5]:
tweets['cuantity'] = 1
tweets_by_loc= tweets.groupby('location').sum()

In [6]:
tweets_by_loc.head()

                        target  cuantity
location
                             1         1
  Glasgow                    0         1
  Melbourne, Australia       0         1
  News                       1         1
  å_                         0         1

In [7]:
tweets_by_loc = tweets_by_loc.sort_values('target', ascending=False)

In [8]:
tweets_by_loc.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3341 entries, USA to Mid West
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   target    3341 non-null   int64
 1   cuantity  3341 non-null   int64
dtypes: int64(2)
memory usage: 78.3+ KB

In [9]:
tweets_by_loc.head(10)

                target  cuantity
location
USA                 67       104
United States       27        50
Nigeria             22        28
India               20        24
Mumbai              19        22
New York            16        71
London              16        45
UK                  16        27
Washington, DC      15        21
Canada              13        29

In [11]:
cuantity_mean = tweets_by_loc['cuantity'].mean()
has_more_tweets_than_cuantity_mean = (tweets_by_loc['cuantity'] > 10)
tweets_frecuency_by_loc = tweets_by_loc[has_more_tweets_than_cuantity_mean]
tweets_frecuency_by_loc['Veracity Absolute Frecuency'] = tweets_by_loc['target'] / tweets_by_loc['cuantity']
tweets_frecuency_by_loc.sort_values('Veracity Absolute Frecuency', ascending =False)

/home/hugo/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

                   target  cuantity  Veracity Absolute Frecuency
location
Mumbai                 19        22                     0.863636
India                  20        24                     0.833333
Nigeria                22        28                     0.785714
Earth                   8        11                     0.727273
Washington, DC         15        21                     0.714286
Washington, D.C.        9        13                     0.692308
USA                    67       104                     0.644231
San Francisco, CA       7        11                     0.636364
Worldwide              12        19                     0.631579
Indonesia               8        13                     0.615385
UK                     16        27                     0.592593
Toronto                 7        12                     0.583333
United States          27        50                     0.540000
Los Angeles             7        13                     0.538462
California, USA         8        15                     0.533333
Ireland                 6        12                     0.500000
Chicago, IL             9        18                     0.500000
Australia               9        18                     0.500000
New York, NY            7        15                     0.466667
Canada                 13        29                     0.448276
San Francisco           6        14                     0.428571
California              7        17                     0.411765
Chicago                 4        11                     0.363636
Seattle                 4        11                     0.363636
London                 16        45                     0.355556
Los Angeles, CA         8        26                     0.307692
United Kingdom          4        14                     0.285714
Kenya                   5        20                     0.250000
New York               16        71                     0.225352
Florida                 3        14                     0.214286
Everywhere              3        15                     0.200000
NYC                     2        12                     0.166667